{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_287", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_574_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_574", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_574", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_575", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_575", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_287", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_574", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_287", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_575", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_574/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.47354030679253967, "scale": 0.003311470676870907, "original_dtype": "float32"}}, {"name": "conv2d_574/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12339359872481402, "scale": 0.0010282799893734501, "original_dtype": "float32"}}, {"name": "conv2d_575/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38425092077722733, "scale": 0.003025597801395491, "original_dtype": "float32"}}, {"name": "conv2d_575/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03047757608925595, "scale": 0.0007433555143720964, "original_dtype": "float32"}}, {"name": "dense_574/kernel", "shape": [1024, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3511894104527492, "scale": 0.00328214402292289, "original_dtype": "float32"}}, {"name": "dense_574/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04116524024044766, "scale": 0.00044263699183277053, "original_dtype": "float32"}}, {"name": "dense_575/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5300027721068438, "scale": 0.004308965626884909, "original_dtype": "float32"}}, {"name": "dense_575/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.05841473117470741, "scale": 1.0, "original_dtype": "float32"}}]}]}