{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_41", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_82_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_82", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_83", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_41", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_82", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_83", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_82/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5786021746841131, "scale": 0.0038065932545007443, "original_dtype": "float32"}}, {"name": "conv2d_82/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10109850396128262, "scale": 0.0015317955145648882, "original_dtype": "float32"}}, {"name": "conv2d_83/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5825165734571569, "scale": 0.004131323216008205, "original_dtype": "float32"}}, {"name": "conv2d_83/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12399002383737004, "scale": 0.0015498752979671254, "original_dtype": "float32"}}, {"name": "dense_82/kernel", "shape": [1024, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4398015492102679, "scale": 0.003518412393682143, "original_dtype": "float32"}}, {"name": "dense_82/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11832943807045618, "scale": 0.0009466355045636495, "original_dtype": "float32"}}, {"name": "dense_83/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7299019717702679, "scale": 0.005839215774162143, "original_dtype": "float32"}}, {"name": "dense_83/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1430021524429321, "scale": 1.0, "original_dtype": "float32"}}]}]}