{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_126", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_252_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_252", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_252", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_253", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_253", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_126", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_126", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_253", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_252/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3763162424751357, "scale": 0.002631582115210739, "original_dtype": "float32"}}, {"name": "conv2d_252/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03670503096837623, "scale": 0.0005169722671602286, "original_dtype": "float32"}}, {"name": "conv2d_253/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.39251631194469977, "scale": 0.003066533687067967, "original_dtype": "float32"}}, {"name": "conv2d_253/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10134275167011747, "scale": 0.0008375434022323758, "original_dtype": "float32"}}, {"name": "dense_252/kernel", "shape": [1024, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.45154140089072436, "scale": 0.0036414629104090674, "original_dtype": "float32"}}, {"name": "dense_252/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04737629013903001, "scale": 0.00043866935313916676, "original_dtype": "float32"}}, {"name": "dense_253/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4190840375189688, "scale": 0.003612793426887662, "original_dtype": "float32"}}, {"name": "dense_253/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2340975999832153, "scale": 1.0, "original_dtype": "float32"}}]}]}