{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_111", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_222_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_222", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_223", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_111", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_222", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_111", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_223", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_222/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4323706552094104, "scale": 0.002844543784272437, "original_dtype": "float32"}}, {"name": "conv2d_222/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06651174434844186, "scale": 0.0009639383238904617, "original_dtype": "float32"}}, {"name": "conv2d_223/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.43740616160280565, "scale": 0.0033907454387814393, "original_dtype": "float32"}}, {"name": "conv2d_223/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0682800012476304, "scale": 0.0005293023352529488, "original_dtype": "float32"}}, {"name": "dense_222/kernel", "shape": [1024, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.36620097195400914, "scale": 0.0032991078554415235, "original_dtype": "float32"}}, {"name": "dense_222/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05207636137219036, "scale": 0.0004568101874753541, "original_dtype": "float32"}}, {"name": "dense_223/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5007849440855139, "scale": 0.004173207867379282, "original_dtype": "float32"}}, {"name": "dense_223/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8692150115966797, "scale": 1.0, "original_dtype": "float32"}}]}]}